RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
/**
 *******************************************************************************
 * @file  hc32f4a0_adc.c
 * @brief This file provides firmware functions to manage the Analog-to-Digital
 *        Converter(ADC).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-06-12       Wuze            First version
   2020-07-02       Wuze            1. API ADC_SH_ChannelCmd() refine.
                                    2. Some other optimizations.
   2020-08-10       Wuze            ADC_SeqClrStatus(): ADC_SEQ_FLAG_NESTED can be cleared.
   2020-12-15       Wuze            ADC_ComTriggerCmd() refine.
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f4a0_adc.h"
#include "hc32f4a0_utility.h"

/**
 * @addtogroup HC32F4A0_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_ADC ADC
 * @brief Analog-to-Digital Converter Driver Library
 * @{
 */

#if (DDL_ADC_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup ADC_Local_Macros ADC Local Macros
 * @{
 */

/**
 * @defgroup ADC_Unit_Base_Address ADC Unit Base Address
 * @{
 */
#define ADC1_BASE                           (0x40040000UL)
#define ADC2_BASE                           (0x40040400UL)
#define ADC3_BASE                           (0x40040800UL)
/**
 * @}
 */

/**
 * @defgroup ADC_Configuration_Bit_Mask ADC Configuration Bit Mask
 * @{
 */
#define ADC_TRIG_SRC_MSK                    (ADC_TRGSR_TRGSELA)
#define ADC_AWD_COMB_MODE_MSK               (ADC_AWDCR_AWDCM)
#define ADC_PGA_CMD_MSK                     (ADC_PGACR1_PGACTL)
#define ADC_PGA_GAIN_MSK                    (ADC_PGACR1_PGAGAIN)
#define ADC_SYNC_CFG_MSK                    (ADC_SYNCCR_SYNCMD | ADC_SYNCCR_SYNCDLY)
#define ADC_CH_MAP_PIN_MSK                  (ADC_CHMUXR0_CH00MUX)
#define ADC_SH_CFG_MSK                      (ADC_SHCR_SHSST)
#define ADC_SH_CH_MSK                       (ADC_SHCR_SHSEL)
#define ADC_COM_TRIG_MSK                    (ADC_COM_TRIG1 | ADC_COM_TRIG2)
#define ADC_TRIG_EVENT_MSK                  (AOS_ADC_1_ITRGSELR_TRGSEL)
/**
 * @}
 */

/**
 * @defgroup ADC_PGA_Command ADC PGA Command
 * @{
 */
#define ADC_PGA_DISABLE                     (0x0U)
#define ADC_PGA_ENABLE                      (0xEU)
/**
 * @}
 */

/**
 * @defgroup ADC_Unit_Number ADC Unit Number
 * @{
 */
#define __ADC_BASE                          (ADC1_BASE)
#define __ADC_UNIT_SIZE                     (0x400UL)
#define ADC_IDX(__ADCx__)                   ((uint8_t)(((uint32_t)&(__ADCx__)->STR - __ADC_BASE) / __ADC_UNIT_SIZE))
/**
 * @}
 */

/**
 * @defgroup ADC_Register_Bit_Band ADC Register Bit Band
 * @{
 */
#define __BIT_BAND_BASE                     (0x42000000UL)
#define __PERIP_BASE                        (0x40000000UL)
#define __REG_OFS(regAddr)                  ((regAddr) - __PERIP_BASE)
#define __BIT_BAND_ADDR(regAddr, pos)       ((__REG_OFS(regAddr) << 5U) + ((uint32_t)(pos) << 2U) + __BIT_BAND_BASE)
#define BIT_BAND(regAddr, pos)              (*(__IO uint32_t *)__BIT_BAND_ADDR((regAddr), (pos)))
/**
 * @}
 */

/**
 * @defgroup ADC_Sequence_Configuration_Bit_Field_Offset ADC Sequence Configuration Bit Field Offset
 * @{
 */
#define ADC_OFS_TRGSR(__seq__)              ((uint32_t)(__seq__) * ADC_TRGSR_TRGSELB_POS)
#define ADC_OFS_AWDCR(__num__)              ((uint32_t)(__num__) * ADC_AWDCR_AWD1EN)
/**
 * @}
 */

/**
 * @defgroup ADC_Register_Configuration_Value ADC Register Configuration Value
 * @{
 */
#define ADC_TRGSR_VAL(__seq__, __val__)     ((uint32_t)(__val__) << ADC_OFS_TRGSR(__seq__))
#define ADC_AWDCR_VAL(__num__, __val__)     ((uint32_t)(__val__) << ADC_OFS_AWDCR(__num__))
/**
 * @}
 */

/**
 * @defgroup ADC_AWD_DR ADC AWD DR
 * @{
 */
#define ADC_AWDx_DR(__base__, __awdNum__)   (*(__IO uint32_t *)((uint32_t)(__base__) + ((uint32_t)(__awdNum__) << 3U)))
/**
 * @}
 */

/**
 * @defgroup ADC_AWD_CHSR ADC AWD CHSR
 * @{
 */
#define ADC_AWDx_CHSR(__base__, __awdNum__) (*(__IO uint32_t *)((uint32_t)(__base__) + ((uint32_t)(__awdNum__) << 3U)))
/**
 * @}
 */

/**
 * @defgroup ADC_Check_Parameters_Validity ADC check parameters validity
 * @{
 */
#define IS_ADC_UNIT(x)                                                         \
(   ((x) == M4_ADC1)                        ||                                 \
    ((x) == M4_ADC2)                        ||                                 \
    ((x) == M4_ADC3))

#define IS_ADC_SEQ(x)                                                          \
(   ((x) == ADC_SEQ_A)                      ||                                 \
    ((x) == ADC_SEQ_B))

#define IS_ADC_SCAN_MODE(x)                                                    \
(   ((x) == ADC_MODE_SA_SSHOT)              ||                                 \
    ((x) == ADC_MODE_SA_CONT)               ||                                 \
    ((x) == ADC_MODE_SA_SB_SSHOT)           ||                                 \
    ((x) == ADC_MODE_SA_CONT_SB_SSHOT))

#define IS_ADC_RESOLUTION(x)                                                   \
(   ((x) == ADC_RESOLUTION_8BIT)            ||                                 \
    ((x) == ADC_RESOLUTION_10BIT)           ||                                 \
    ((x) == ADC_RESOLUTION_12BIT))

#define IS_ADC_TRIG_SRC(x)                                                     \
(   ((x) == ADC_TRIG_SRC_ADTRG)             ||                                 \
    ((x) == ADC_TRIG_SRC_EVENT0)            ||                                 \
    ((x) == ADC_TRIG_SRC_EVENT1)            ||                                 \
    ((x) == ADC_TRIG_SRC_EVENT0_EVENT1))

#define IS_ADC_AUTO_CLEAR_CMD(x)                                               \
(   ((x) == ADC_AUTO_CLR_DISABLE)           ||                                 \
    ((x) == ADC_AUTO_CLR_ENABLE))

