RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
#define IS_ADC_DATA_ALIGN(x)                                                   \
(   ((x) == ADC_DATA_ALIGN_RIGHT)           ||                                 \
    ((x) == ADC_DATA_ALIGN_LEFT))

#define IS_ADC_SA_RESUME_POS(x)                                                \
(   ((x) == ADC_SA_RESUME_POS_INT_CH)       ||                                 \
    ((x) == ADC_SA_RESUME_POS_FIRST_CH))

#define IS_ADC_SAMPLE_TIME(x)                                                  \
(   ((x) >= 5U))

#define IS_ADC_AVG_CNT(x)                                                      \
(   ((x) == ADC_AVG_CNT_2)                  ||                                 \
    ((x) == ADC_AVG_CNT_4)                  ||                                 \
    ((x) == ADC_AVG_CNT_8)                  ||                                 \
    ((x) == ADC_AVG_CNT_16)                 ||                                 \
    ((x) == ADC_AVG_CNT_32)                 ||                                 \
    ((x) == ADC_AVG_CNT_64)                 ||                                 \
    ((x) == ADC_AVG_CNT_128)                ||                                 \
    ((x) == ADC_AVG_CNT_256))

#define IS_ADC_EXCH_SRC(x)                                                     \
(   ((x) == ADC_EXCH_SRC_ADC_PIN)           ||                                 \
    ((x) == ADC_EXCH_SRC_INTERNAL))

#define IS_AWD_UNIT(x)                                                         \
(   ((x) == ADC_AWD_0)                      ||                                 \
    ((x) == ADC_AWD_1))

#define IS_AWD_CH_NUM(x)                                                       \
(   ((x) <= ADC_CH_NUM_15))

#define IS_AWD_CMP_MODE(x)                                                     \
(   ((x) == ADC_AWD_CMP_OUT_RANGE)          ||                                 \
    ((x) == ADC_AWD_CMP_IN_RANGE))

#define IS_AWD_COMB_MODE(x)                                                    \
(   ((x) == ADC_AWD_COMB_OR)                ||                                 \
    ((x) == ADC_AWD_COMB_AND)               ||                                 \
    ((x) == ADC_AWD_COMB_XOR))

#define IS_PGA_UNIT(x)                                                         \
(   ((x) <= ADC_PGA_4))

#define IS_PGA_GAIN(x)                                                         \
(   ((x) <= ADC_PGA_GAIN_32))

#define IS_PGA_VSS(x)                                                          \
(   ((x) == ADC_PGA_VSS_PGAVSS)             ||                                 \
    ((x) == ADC_PGA_VSS_AVSS))

#define IS_ADC_SYNC_MODE(x)                                                    \
(   ((x) == ADC_SYNC_SSHOT_SEQUENTIAL)      ||                                 \
    ((x) == ADC_SYNC_SSHOT_SIMULTANEOUS)    ||                                 \
    ((x) == ADC_SYNC_CONT_SEQUENTIAL)       ||                                 \
    ((x) == ADC_SYNC_CONT_SIMULTANEOUS))

#define IS_ADC_SYNC_UNIT(x)                                                    \
(   ((x) == ADC_SYNC_ADC1_ADC2)             ||                                 \
    ((x) == ADC_SYNC_ADC1_ADC2_ADC3))

#define IS_ADC_SYNC_TRIG_DLY(x)                                                \
(   ((x) != 0U))

#define IS_ADC_REMAP_PIN_NUM(x)                                                \
(   ((x) <= ADC12_IN15))

#define IS_ADC1_DR_LENGTH(x)                                                   \
(   ((x) >= ADC1_CH_COUNT))

#define IS_ADC2_DR_LENGTH(x)                                                   \
(   ((x) >= ADC2_CH_COUNT))

#define IS_ADC3_DR_LENGTH(x)                                                   \
(   ((x) >= ADC3_CH_COUNT))

#define IS_ADC_1_BIT_MSK(x)                                                    \
(   ((x) != 0U)                             &&                                 \
    (((x) & ((x) - 1U)) == 0U))

#define IS_ADC_BIT_MSK(x, msk)                                                 \
(   ((x) != 0U)                             &&                                 \
    (((x) | (msk)) == (msk)))

/**
 * @}
 */

/**
 * @defgroup ADC_Miscellaneous_Macros ADC Miscellaneous Macros
 * @{
 */
#define ADC_UNIT_COUNT                      (3U)
#define ADC_IND_SPL_TIME_COUNT              (16U)
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup ADC_Global_Functions ADC Global Functions
 * @{
 */

/**
 * @brief  Initializes the specified ADC peripheral according to the specified parameters
 *         in the structure stc_adc_init_t.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  pstcInit               Pointer to a stc_adc_init_t structure value that
 *                                      contains the configuration information for the ADC.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t ADC_Init(M4_ADC_TypeDef *ADCx, const stc_adc_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));
        DDL_ASSERT(IS_ADC_SCAN_MODE(pstcInit->u16ScanMode));
        DDL_ASSERT(IS_ADC_RESOLUTION(pstcInit->u16Resolution));
        DDL_ASSERT(IS_ADC_AUTO_CLEAR_CMD(pstcInit->u16AutoClrCmd));
        DDL_ASSERT(IS_ADC_DATA_ALIGN(pstcInit->u16DataAlign));
        DDL_ASSERT(IS_ADC_SA_RESUME_POS(pstcInit->u16SAResumePos));

        /* Configures scan convert mode, resolution, data automatically clear command
           and data alignment. */
        WRITE_REG16(ADCx->CR0,                 \
                    (pstcInit->u16ScanMode   | \
                     pstcInit->u16Resolution | \
                     pstcInit->u16AutoClrCmd | \
                     pstcInit->u16DataAlign));

        /* Configures the channel sequence A restart from. */
        WRITE_REG16(ADCx->CR1, pstcInit->u16SAResumePos);

