RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initializes the ADC peripheral. Reset the registers of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @retval None
 */
void ADC_DeInit(M4_ADC_TypeDef *ADCx)
{
    uint8_t i;
    uint32_t u32SSTRAddr;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));

    /* Stop the ADC. */
    WRITE_REG8(ADCx->STR, 0U);

    /* Set the registers to reset value. */
    WRITE_REG16(ADCx->CR0, 0x0U);
    WRITE_REG16(ADCx->CR1, 0x0U);
    WRITE_REG16(ADCx->TRGSR, 0x0U);

    WRITE_REG32(ADCx->CHSELRA, 0x0U);
    WRITE_REG32(ADCx->CHSELRB, 0x0U);
    WRITE_REG32(ADCx->AVCHSELR, 0x0U);
    WRITE_REG8(ADCx->EXCHSELR, 0x0U);

    WRITE_REG16(ADCx->CHMUXR0, 0x3210U);
    WRITE_REG16(ADCx->CHMUXR1, 0x7654U);
    WRITE_REG16(ADCx->CHMUXR2, 0xBA98U);
    WRITE_REG16(ADCx->CHMUXR3, 0xFEDCU);

    WRITE_REG8(ADCx->ICR, 0x03U);
    WRITE_REG8(ADCx->ISCLRR, 0x13U);

    WRITE_REG16(ADCx->AWDCR, 0x0U);
    WRITE_REG8(ADCx->AWDSCLRR, 0x13U);

    WRITE_REG16(ADCx->AWD0DR0, 0x0U);
    WRITE_REG16(ADCx->AWD0DR1, 0xFFFFU);
    WRITE_REG16(ADCx->AWD1DR0, 0x0U);
    WRITE_REG16(ADCx->AWD1DR1, 0xFFFFU);

    WRITE_REG8(ADCx->AWD0CHSR, 0x0U);
    WRITE_REG8(ADCx->AWD1CHSR, 0x0U);

    u32SSTRAddr = (uint32_t)&ADCx->SSTR0;
    for (i=0U; i<ADC_IND_SPL_TIME_COUNT; i++)
    {
        RW_MEM8(u32SSTRAddr) = (uint8_t)0x0BU;
        u32SSTRAddr++;
    }

    if (ADCx == M4_ADC1)
    {
        WRITE_REG16(ADCx->SYNCCR, 0x0C00U);
        WRITE_REG16(ADCx->SHCR, 0x18U);
        WRITE_REG8(ADCx->PGACR1, 0x0U);
        WRITE_REG8(ADCx->PGACR2, 0x0U);
        WRITE_REG8(ADCx->PGACR3, 0x0U);
        WRITE_REG8(ADCx->PGAVSSENR, 0x0U);
    }
    else if (ADCx == M4_ADC2)
    {
        WRITE_REG8(ADCx->PGACR1, 0x0U);
        WRITE_REG8(ADCx->PGAVSSENR, 0x0U);
    }
    else if (ADCx == M4_ADC3)
    {
        WRITE_REG8(ADCx->SSTRL, 0x0BU);
    }
    else
    {
        /* rsvd */
    }
}

/**
 * @brief  Set a default value for the ADC initialization structure.
 * @param  [in]  pstcInit               Pointer to a stc_adc_init_t structure that
 *                                      contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pstcInit == NULL.
 */
en_result_t ADC_StructInit(stc_adc_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcInit != NULL)
    {
        pstcInit->u16ScanMode    = ADC_MODE_SA_SSHOT;
        pstcInit->u16Resolution  = ADC_RESOLUTION_12BIT;
        pstcInit->u16AutoClrCmd  = ADC_AUTO_CLR_DISABLE;
        pstcInit->u16DataAlign   = ADC_DATA_ALIGN_RIGHT;
        pstcInit->u16SAResumePos = ADC_SA_RESUME_POS_INT_CH;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set scan convert mode for the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u16Mode                ADC san convert mode.
 *                                      This parameter can be a value of @ref ADC_Scan_Convert_Mode.
 *   @arg  ADC_MODE_SA_SSHOT:           Sequence A single shot.
 *   @arg  ADC_MODE_SA_CONT:            Sequence A continuous.
 *   @arg  ADC_MODE_SA_SB_SSHOT:        Sequence A and B both single shot.
 *   @arg  ADC_MODE_SA_CONT_SB_SSHOT:   Sequence A continuous and sequence B single shot.
 * @retval None
 */
void ADC_SetScanMode(M4_ADC_TypeDef *ADCx, uint16_t u16Mode)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_SCAN_MODE(u16Mode));
    MODIFY_REG16(ADCx->CR0, ADC_CR0_MS, u16Mode);
}

/**
 * @brief  Enable or disable the specified sequence's channels.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Seq                  The sequence that it's specified channels will be enabled or disabled.
 *                                      This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A:                   Sequence A.
 *   @arg  ADC_SEQ_B:                   Sequence B.
 * @param  [in]  u32AdcCh               The ADC channels.
 *                                      This parameter can be values of @ref ADC_Channel
 *   @arg  ADC_CH0 ~ ADC_CH15:          For M4_ADC1 and M4_ADC2.
 *   @arg  ADC_CH0 ~ ADC_CH19:          For M4_ADC3.
 * @param  [in]  pu8SplTime:            Pointer to an uint8_t type array which contains sampling time of the specified channels.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified sequence's specified channels.
 *   @arg  Disable:                     Disable the specified sequence's specified channels.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pu8SplTime == NULL.
 * @note   Sequence A and Sequence B CAN NOT include the same channel!
 * @note   ADC_CH16 ~ ADC_CH19 of ADC3 share the same sampling time.
 */
en_result_t ADC_ChannelCmd(M4_ADC_TypeDef *ADCx, uint8_t u8Seq, \
                           uint32_t u32AdcCh, const uint8_t pu8SplTime[], \
                           en_functional_state_t enNewState)
{
    uint8_t i = 0U;
    uint8_t j = 0U;
    uint32_t u32CHSELAddr;
    uint32_t u32SSTRAddr;
    uint32_t au32ChMsk[] = {ADC1_CH_ALL, ADC2_CH_ALL, ADC3_CH_ALL};
    en_result_t enRet = ErrorInvalidParameter;

    if (pu8SplTime != NULL)
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));
        DDL_ASSERT(IS_ADC_SEQ(u8Seq));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

        u32CHSELAddr = (uint32_t)&ADCx->CHSELRA + ((uint32_t)u8Seq * 4U);
        u32SSTRAddr  = (uint32_t)&ADCx->SSTR0;
        u32AdcCh    &= au32ChMsk[ADC_IDX(ADCx)];

        if (enNewState == Enable)
        {
            RW_MEM32(u32CHSELAddr) |= u32AdcCh;

            while (u32AdcCh != 0U)
            {
                if ((u32AdcCh & 0x1UL) != 0U)
                {
                    DDL_ASSERT(IS_ADC_SAMPLE_TIME(pu8SplTime[j]));
                    RW_MEM8(u32SSTRAddr+i) = pu8SplTime[j];
                    if (i < ADC_IND_SPL_TIME_COUNT)
                    {
                        j++;
                    }
                }
                u32AdcCh >>= 1U;
                if (i < ADC_IND_SPL_TIME_COUNT)
                {
                    i++;
                }
            }
        }
        else
        {
            RW_MEM32(u32CHSELAddr) &= (uint32_t)(~u32AdcCh);
        }

