RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set average count for the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u16AvgCnt              The average count to be set for the specified ADC unit.
 *                                      This parameter can be a value of @ref ADC_Average_Count
 *   @arg  ADC_AVG_CNT_2
 *   @arg  ADC_AVG_CNT_4
 *   @arg  ADC_AVG_CNT_8
 *   @arg  ADC_AVG_CNT_16
 *   @arg  ADC_AVG_CNT_32
 *   @arg  ADC_AVG_CNT_64
 *   @arg  ADC_AVG_CNT_128
 *   @arg  ADC_AVG_CNT_256
 * @retval None
 */
void ADC_AvgChannelConfig(M4_ADC_TypeDef *ADCx, uint16_t u16AvgCnt)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_AVG_CNT(u16AvgCnt));
    MODIFY_REG16(ADCx->CR0, ADC_CR0_AVCNT, u16AvgCnt);
}

/**
 * @brief  Enable or disable the specified ADC unit's average channels.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u32AdcCh               The ADC channels.
 *                                      This parameter can be values of @ref ADC_Channel
 *   @arg  ADC_CH0 ~ ADC_CH15:          For M4_ADC1 and M4_ADC2.
 *   @arg  ADC_CH0 ~ ADC_CH19:          For M4_ADC3.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified ADC unit's average channels.
 *   @arg  Disable:                     Disable the specified ADC unit's average channels.
 * @retval None
 */
void ADC_AvgChannelCmd(M4_ADC_TypeDef *ADCx, uint32_t u32AdcCh, en_functional_state_t enNewState)
{
    uint32_t u32SACh;
    uint32_t u32SBCh;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32SACh = ADCx->CHSELRA;
    u32SBCh = ADCx->CHSELRB;
    u32AdcCh &= (u32SACh | u32SBCh);
    if (enNewState == Enable)
    {
        SET_REG32_BIT(ADCx->AVCHSELR, u32AdcCh);
    }
    else
    {
        CLEAR_REG32_BIT(ADCx->AVCHSELR, u32AdcCh);
    }
}

/**
 * @brief  Set analog input source for the specified ADC unit's extend channel.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8ExChSrc              The analog input source for the extend channel.
 *                                      This parameter can be a value of @ref ADC_Extend_Channel_Source
 *   @arg  ADC_EXCH_SRC_ADC_PIN:        The analog input source of extend channel is ADC analog input pin,
 *                                      ADC12_IN15 of ADC1/ADC2 and ADC3_IN15 of ADC3.
 *   @arg  ADC_EXCH_SRC_INTERNAL:       The analog input source of extend channels is internal reference voltage or
 *                                      the partial voltage of VBAT.
 * @retval None
 */
void ADC_SetExChannelSrc(M4_ADC_TypeDef *ADCx, uint8_t u8ExChSrc)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_EXCH_SRC(u8ExChSrc));
    WRITE_REG8(ADCx->EXCHSELR, u8ExChSrc);
}

/**
 * @brief  Set a default value for the trigger source configuration structure.
 * @param  [in]  pstcCfg                Pointer to a stc_adc_trig_cfg_t structure that
 *                                      contains configuration information.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t ADC_TrigSrcStructInit(stc_adc_trig_cfg_t *pstcCfg)
{
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        pstcCfg->u16TrigSrc = ADC_TRIG_SRC_ADTRG;
        pstcCfg->enEvent0   = EVT_MAX;
        pstcCfg->enEvent1   = EVT_MAX;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Configures the trigger source for the specified sequence of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Seq                  The sequence to be configured.
 *                                      This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A:                   Sequence A.
 *   @arg  ADC_SEQ_B:                   Sequence B.
 * @param  [in]  pstcCfg                Pointer to a stc_adc_trig_cfg_t structure that contains
 *                                      the configuration information of the trigger source.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 * @note   ADC must be stopped while calling this function.
 * @note   The trigger source CANNOT be an event that generated by the sequence itself.
 */
en_result_t ADC_TrigSrcConfig(M4_ADC_TypeDef *ADCx, uint8_t u8Seq, const stc_adc_trig_cfg_t *pstcCfg)
{
    uint32_t u32AdcIdx;
    uint32_t u32ITRGSELRAddr;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));
        DDL_ASSERT(IS_ADC_SEQ(u8Seq));
        DDL_ASSERT(IS_ADC_TRIG_SRC(pstcCfg->u16TrigSrc));

        u32AdcIdx = ADC_IDX(ADCx);
        u32ITRGSELRAddr = (uint32_t)&M4_AOS->ADC_1_ITRGSELR0 + u32AdcIdx * 8U;
        if ((pstcCfg->u16TrigSrc & ADC_TRIG_SRC_EVENT0) != 0U)
        {
            MODIFY_REG32(RW_MEM32(u32ITRGSELRAddr), ADC_TRIG_EVENT_MSK, pstcCfg->enEvent0);
        }

        if ((pstcCfg->u16TrigSrc & ADC_TRIG_SRC_EVENT1) != 0U)
        {
            u32ITRGSELRAddr += 4U;
            MODIFY_REG32(RW_MEM32(u32ITRGSELRAddr), ADC_TRIG_EVENT_MSK, pstcCfg->enEvent1);
        }

        MODIFY_REG16(ADCx->TRGSR, \
                     ADC_TRGSR_VAL(u8Seq, ADC_TRIG_SRC_MSK), \
                     ADC_TRGSR_VAL(u8Seq, pstcCfg->u16TrigSrc));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable the trigger source of the specified sequence.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Seq                  The sequence to be configured.
 *                                      This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A:                   Sequence A.
 *   @arg  ADC_SEQ_B:                   Sequence B.
 * @param  [in]  enNewState             An en_functional_state_t enumeration value.
 *   @arg  Enable:                      Enable the trigger source of the specified sequence.
 *   @arg  Disable:                     Disable the trigger source of the specified sequence.
 * @retval None
 * @note   ADC must be stopped while calling this function.
 */
void ADC_TrigSrcCmd(M4_ADC_TypeDef *ADCx, uint8_t u8Seq, en_functional_state_t enNewState)
{
    uint32_t u32Addr;
    uint8_t au8CmdPos[] = {ADC_TRGSR_TRGENA_POS, ADC_TRGSR_TRGENB_POS};

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_SEQ(u8Seq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Addr = (uint32_t)&ADCx->TRGSR;
    BIT_BAND(u32Addr, au8CmdPos[u8Seq]) = (uint32_t)enNewState;
}

/**
 * @brief  Enable or disable common trigger event to start ADC.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u16TrigSrc             ADC trigger source type.
 *                                      This parameter can be a value of @ref ADC_Trigger_Source_Type except ADC_TRIG_SRC_ADTRG.
 *   @arg  ADC_TRIG_SRC_EVENT0:         The trigger source is a internal event from other peripheral. \
 *                                      Only one event can be configured to trigger ADC.
 *   @arg  ADC_TRIG_SRC_EVENT1:         The trigger source is a internal event from other peripheral. \
 *                                      Only one event can be configured to trigger ADC.
 *   @arg  ADC_TRIG_SRC_EVENT0_EVENT1:  The trigger source are two internal events from other peripheral(s). \
 *                                      Two events can be configured to trigger ADC and one of which can trigger the ADC.
 * @param  [in]  u32ComTrig             Common trigger event enable bit mask.
 *                                      This parameter can be a value of @ref ADC_Common_Trigger_Sel
 *   @arg  ADC_COM_TRIG1:               Common trigger 1.
 *   @arg  ADC_COM_TRIG2:               Common trigger 2.
 * @param  [in]  enNewState             An en_functional_state_t enumeration type value.
 *   @arg Enable:                       Enable the specified common trigger.
 *   @arg Disable:                      Disable the specified common trigger.
 * @retval None
 */
void ADC_ComTriggerCmd(M4_ADC_TypeDef *ADCx, uint16_t u16TrigSrc, \
                       uint32_t u32ComTrig, en_functional_state_t enNewState)
{
    uint32_t u32AdcIdx;
    uint32_t u32ITRGSELRAddr;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_BIT_MSK(u32ComTrig, ADC_COM_TRIG_MSK));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32AdcIdx = ADC_IDX(ADCx);
    u32ITRGSELRAddr = (uint32_t)&M4_AOS->ADC_1_ITRGSELR0 + u32AdcIdx * 8U;

    if ((u16TrigSrc & ADC_TRIG_SRC_EVENT0) != 0U)
    {
        if (enNewState == Enable)
        {
            SET_REG32_BIT(RW_MEM32(u32ITRGSELRAddr), u32ComTrig);
        }
        else
        {
            CLEAR_REG32_BIT(RW_MEM32(u32ITRGSELRAddr), u32ComTrig);
        }
    }

    if ((u16TrigSrc & ADC_TRIG_SRC_EVENT1) != 0U)
    {
        u32ITRGSELRAddr += 4UL;
        if (enNewState == Enable)
        {
            SET_REG32_BIT(RW_MEM32(u32ITRGSELRAddr), u32ComTrig);
        }
        else
        {
            CLEAR_REG32_BIT(RW_MEM32(u32ITRGSELRAddr), u32ComTrig);
        }
    }
}

/**
 * @brief  Enable or disable the interrupt of the specified ADC unit's specified sequence.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Seq                  The sequence to be configured.
 *                                      This parameter can be a value of @ref ADC_Sequence
 *   @arg  ADC_SEQ_A:                   Sequence A.
 *   @arg  ADC_SEQ_B:                   Sequence B.
 * @param  [in]  enNewState             An en_functional_state_t enumeration value.
 *   @arg  Enable:                      Enable the interrupt of the specified sequence.
 *   @arg  Disable:                     Disable the interrupt of the specified sequence.
 * @retval None
 */
void ADC_SeqIntCmd(M4_ADC_TypeDef *ADCx, uint8_t u8Seq, en_functional_state_t enNewState)
{
    uint32_t u32Addr;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_SEQ(u8Seq));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Addr = (uint32_t)&ADCx->ICR;
    BIT_BAND(u32Addr, u8Seq) = (uint32_t)enNewState;
}

/**
 * @brief  Get the status flag of the specified ADC unit's specified sequence.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Flag                 Status flag type.
 *                                      This parameter can be valueS of @ref ADC_Sequence_Status_Flag
 *   @arg  ADC_SEQ_FLAG_EOCA:           Status flag of the end of conversion of sequence A.
 *   @arg  ADC_SEQ_FLAG_EOCB:           Status flag of the end of conversion of sequence B.
 *   @arg  ADC_SEQ_FLAG_NESTED:         Status flag of sequence A was interrupted by sequence B.
 * @retval An en_flag_status_t enumeration type value.
 *   @arg  Set:                         At least one of the specified flags is set.
 *   @arg  Reset:                       The specified flags are not set.
 */
en_flag_status_t ADC_SeqGetStatus(const M4_ADC_TypeDef *ADCx, uint8_t u8Flag)
{
    en_flag_status_t enRet = Reset;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));

    if (READ_REG8_BIT(ADCx->ISR, (u8Flag & (uint8_t)ADC_SEQ_FLAG_ALL)) != 0U)
    {
        enRet = Set;
    }

    return enRet;
}

/**
 * @brief  Clear the status flag of the specified ADC unit's specified sequence.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Flag                 Status flag type.
 *                                      This parameter can be values of @ref ADC_Sequence_Status_Flag
 *   @arg  ADC_SEQ_FLAG_EOCA:           Status flag of the end of conversion of sequence A.
 *   @arg  ADC_SEQ_FLAG_EOCB:           Status flag of the end of conversion of sequence B.
 *   @arg  ADC_SEQ_FLAG_NESTED:         Status flag of sequence A was interrupted by sequence B.
 * @retval None
 */
void ADC_SeqClrStatus(M4_ADC_TypeDef *ADCx, uint8_t u8Flag)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    SET_REG8_BIT(ADCx->ISCLRR, (u8Flag & (uint8_t)ADC_SEQ_FLAG_ALL));
}

/**
 * @brief  Configures analog watchdog(AWD).
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8AWDx                 AWD unit that is going to be configured.
 *                                      This parameter can be a value of @ref ADC_AWD_Unit
 *   @arg  ADC_AWD_0:                   AWD unit 0 of the specified ADC.
 *   @arg  ADC_AWD_1:                   AWD unit 1 of the specified ADC.
 * @param  [in]  pstcCfg                Pointer to a stc_adc_awd_cfg_t structure value that
 *                                      contains the configuration information for the AWD.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:       pstcCfg == NULL.
 */
en_result_t ADC_AWD_Config(M4_ADC_TypeDef *ADCx, uint8_t u8AWDx, const stc_adc_awd_cfg_t *pstcCfg)
{
    uint32_t u32AwdCr;
    uint32_t u32AwdDr0;
    uint32_t u32AwdDr1;
    uint32_t u32AwdChsr;
    uint32_t u32Pos;
    en_result_t enRet = ErrorInvalidParameter;

    if (pstcCfg != NULL)
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));
        DDL_ASSERT(IS_AWD_UNIT(u8AWDx));
        DDL_ASSERT(IS_AWD_CH_NUM(pstcCfg->u8ChNum));
        DDL_ASSERT(IS_AWD_CMP_MODE(pstcCfg->u16CmpMode));

