RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
        u32Pos     = ((uint32_t)u8AWDx << 2U) + ADC_AWDCR_AWD0MD_POS;
        u32AwdCr   = (uint32_t)&ADCx->AWDCR;
        u32AwdDr0  = (uint32_t)&ADCx->AWD0DR0;
        u32AwdDr1  = (uint32_t)&ADCx->AWD0DR1;
        u32AwdChsr = (uint32_t)&ADCx->AWD0CHSR;

        BIT_BAND(u32AwdCr, u32Pos) = (uint32_t)pstcCfg->u16CmpMode;
        ADC_AWDx_DR(u32AwdDr0, u8AWDx) = pstcCfg->u16LowerLimit;
        ADC_AWDx_DR(u32AwdDr1, u8AWDx) = pstcCfg->u16UpperLimit;
        ADC_AWDx_CHSR(u32AwdChsr, u8AWDx) = pstcCfg->u8ChNum;

        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Enable or disable combination mode of analog watchdog(AWD).
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u16CombMode            Combination mode of analog watchdog.
 *                                      This parameter can be a value of @ref ADC_AWD_Combination_Mode
 *   @arg  ADC_AWD_COMB_OR:             The status of AWD0 is set or the status of AWD1 is set, the status of combination mode is set.
 *   @arg  ADC_AWD_COMB_AND:            The status of AWD0 is set and the status of AWD1 is set, the status of combination mode is set.
 *   @arg  ADC_AWD_COMB_XOR:            Only one of the status of AWD0 and AWD1 is set, the status of combination mode is set.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the combination mode of specified ADC unit's AWD.
 *   @arg  Disable:                     Disable the combination mode of specified ADC unit's AWD.
 * @retval None
 */
void ADC_AWD_CombModeCmd(M4_ADC_TypeDef *ADCx, uint16_t u16CombMode, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_AWD_COMB_MODE(u16CombMode));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    CLEAR_REG16_BIT(ADCx->AWDCR, ADC_AWD_COMB_MODE_MSK);
    if (enNewState == Enable)
    {
        SET_REG16_BIT(ADCx->AWDCR, u16CombMode);
    }
}

/**
 * @brief  Enable or disable the specified analog watchdog(AWD).
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8AWDx                 AWD unit that is going to be enabled or disabled.
 *                                      This parameter can be a value of @ref ADC_AWD_Unit
 *   @arg  ADC_AWD_0:                   AWD unit 0 of the specified ADC.
 *   @arg  ADC_AWD_1:                   AWD unit 1 of the specified ADC.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified AWD.
 *   @arg  Disable:                     Disable the specified AWD.
 * @retval None
 */
void ADC_AWD_Cmd(M4_ADC_TypeDef *ADCx, uint8_t u8AWDx, en_functional_state_t enNewState)
{
    uint32_t u32Addr;
    uint32_t u32Pos;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_AWD_UNIT(u8AWDx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Pos  = ((uint32_t)u8AWDx << 2U) + ADC_AWDCR_AWD0EN_POS;
    u32Addr = (uint32_t)&ADCx->AWDCR;
    BIT_BAND(u32Addr, u32Pos) = (uint32_t)enNewState;
}

/**
 * @brief  Enable or disable the specified analog watchdog's interrupt.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8AWDx                 AWD unit.
 *                                      This parameter can be a value of @ref ADC_AWD_Unit
 *   @arg  ADC_AWD_0:                   AWD unit 0 of the specified ADC.
 *   @arg  ADC_AWD_1:                   AWD unit 1 of the specified ADC.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified AWD's interrupt.
 *   @arg  Disable:                     Disable the specified AWD's interrupt.
 * @retval None
 */
void ADC_AWD_IntCmd(M4_ADC_TypeDef *ADCx, uint8_t u8AWDx, en_functional_state_t enNewState)
{
    uint32_t u32Addr;
    uint32_t u32Pos;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_AWD_UNIT(u8AWDx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32Pos  = ((uint32_t)u8AWDx << 2U) + ADC_AWDCR_AWD0IEN_POS;
    u32Addr = (uint32_t)&ADCx->AWDCR;
    BIT_BAND(u32Addr, u32Pos) = (uint32_t)enNewState;
}

/**
 * @brief  Get the analog watchdog's flag status of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Flag                 AWD status flag type.
 *                                      This parameter can be values of @ref ADC_AWD_Status_Flag
 *   @arg  ADC_AWD_FLAG_AWD0:           Flag of AWD0.
 *   @arg  ADC_AWD_FLAG_AWD1:           Flag of AWD1.
 *   @arg  ADC_AWD_FLAG_COMB:           Flag of combination mode.
 * @retval An en_flag_status_t enumeration type value.
 *   @arg  Set:                         At least one of the specified flags is set.
 *   @arg  Reset:                       The specified flags are not set.
 */
en_flag_status_t ADC_AWD_GetStatus(const M4_ADC_TypeDef *ADCx, uint8_t u8Flag)
{
    en_flag_status_t enRet = Reset;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));

    if (READ_REG8_BIT(ADCx->AWDSR, (u8Flag & (uint8_t)ADC_AWD_FLAG_ALL)) != 0U)
    {
        enRet = Set;
    }

    return enRet;
}

/**
 * @brief  Clear the analog watchdog's flag status of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8Flag                 AWD status flag type.
 *                                      This parameter can be values of @ref ADC_AWD_Status_Flag
 *   @arg  ADC_AWD_FLAG_AWD0:           Flag of AWD0.
 *   @arg  ADC_AWD_FLAG_AWD1:           Flag of AWD1.
 *   @arg  ADC_AWD_FLAG_COMB:           Flag of combination mode.
 * @retval None
 */
void ADC_AWD_ClrStatus(M4_ADC_TypeDef *ADCx, uint8_t u8Flag)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    u8Flag &= (uint8_t)ADC_AWD_FLAG_ALL;
    SET_REG8_BIT(ADCx->AWDSCLRR, u8Flag);
}

/**
 * @brief  Configures the specified programmable gain amplifier(PGA).
 * @param  [in]  u8PGAx                 The PGA unit that is going to be configured.
 *                                      This parameter can be a value of @ref ADC_PGA_Unit
 *   @arg  ADC_PGA_1:                   PGA1, belongs to ADC1. Input pin is ADC123_IN0.
 *   @arg  ADC_PGA_2:                   PGA2, belongs to ADC1. Input pin is ADC123_IN1.
 *   @arg  ADC_PGA_3:                   PGA3, belongs to ADC1. Input pin is ADC123_IN2.
 *   @arg  ADC_PGA_4:                   PGA4, belongs to ADC2. Input pin is ADC12_IN7.
 * @param  [in]  u8GainFactor           Gain factor for the specified PGA.
 *                                      This parameter can be a value of @ref ADC_PGA_Gain_Factor
 *   @arg  ADC_PGA_GAIN_2:              PGA gain factor is 2.
 *   @arg  ADC_PGA_GAIN_2P133:          PGA gain factor is 2.133.
 *   @arg  ADC_PGA_GAIN_2P286:          PGA gain factor is 2.286.
 *   @arg  ADC_PGA_GAIN_2P667:          PGA gain factor is 2.667.
 *   @arg  ADC_PGA_GAIN_2P909:          PGA gain factor is 2.909.
 *   @arg  ADC_PGA_GAIN_3P2:            PGA gain factor is 3.2.
 *   @arg  ADC_PGA_GAIN_3P556:          PGA gain factor is 2.556.
 *   @arg  ADC_PGA_GAIN_4:              PGA gain factor is 4.
 *   @arg  ADC_PGA_GAIN_4P571:          PGA gain factor is 4.571.
 *   @arg  ADC_PGA_GAIN_5P333:          PGA gain factor is 5.333.
 *   @arg  ADC_PGA_GAIN_6P4:            PGA gain factor is 6.4.
 *   @arg  ADC_PGA_GAIN_8:              PGA gain factor is 8.
 *   @arg  ADC_PGA_GAIN_10P667:         PGA gain factor is 10.667.
 *   @arg  ADC_PGA_GAIN_16:             PGA gain factor is 16.
 *   @arg  ADC_PGA_GAIN_32:             PGA gain factor is 32.
 * @param  [in]  u8PgaVss               VSS for the specified PGA.
 *                                      This parameter can be a value of @ref ADC_PGA_VSS
 *   @arg  ADC_PGA_VSS_PGAVSS:          Use pin PGA123_VSS as the reference GND of PGA1, PGA2 and PGA3.
 *   @arg  ADC_PGA_VSS_AVSS:            Use AVSS as the reference GND of PGA1, PGA2 and PGA3.
 * @retval None
 */
void ADC_PGA_Config(uint8_t u8PGAx, uint8_t u8GainFactor, uint8_t u8PgaVss)
{
    uint32_t u32Addr;
    uint32_t u32PGACRAddr;
    M4_ADC_TypeDef *ADCx;
    uint32_t au32AdcBase[] = {ADC1_BASE, ADC1_BASE, ADC1_BASE, ADC2_BASE};

