RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
    DDL_ASSERT(IS_PGA_GAIN(u8GainFactor));
    DDL_ASSERT(IS_PGA_VSS(u8PgaVss));
    DDL_ASSERT(IS_PGA_UNIT(u8PGAx));

    ADCx    = (M4_ADC_TypeDef *)au32AdcBase[u8PGAx];
    u8PGAx %= 3U;
    u32PGACRAddr = (uint32_t)&ADCx->PGACR1 + u8PGAx;
    MODIFY_REG8(RW_MEM8(u32PGACRAddr), ADC_PGA_GAIN_MSK, u8GainFactor);
    u32Addr = (uint32_t)&ADCx->PGAVSSENR;
    BIT_BAND(u32Addr, u8PGAx) = (uint32_t)u8PgaVss;
}

/**
 * @brief  Enable the specified programmable gain amplifier(PGA).
 * @param  [in]  u8PGAx                 The PGA unit which is going to be enabled or disabled.
 *                                      This parameter can be a value of @ref ADC_PGA_Unit
 *   @arg  ADC_PGA_1:                   PGA1, belongs to ADC1. Input pin is ADC123_IN0.
 *   @arg  ADC_PGA_2:                   PGA2, belongs to ADC1. Input pin is ADC123_IN1.
 *   @arg  ADC_PGA_3:                   PGA3, belongs to ADC1. Input pin is ADC123_IN2.
 *   @arg  ADC_PGA_4:                   PGA4, belongs to ADC2. Input pin is ADC12_IN7.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified PGA.
 *   @arg  Disable:                     Disable the specified PGA.
 * @retval None
 */
void ADC_PGA_Cmd(uint8_t u8PGAx, en_functional_state_t enNewState)
{
    uint32_t u32PGACRAddr;
    M4_ADC_TypeDef *ADCx;
    uint32_t au32AdcBase[] = {ADC1_BASE, ADC1_BASE, ADC1_BASE, ADC2_BASE};
    uint8_t au8Cmd[] = {ADC_PGA_DISABLE, ADC_PGA_ENABLE};

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    DDL_ASSERT(IS_PGA_UNIT(u8PGAx));

    ADCx    = (M4_ADC_TypeDef *)au32AdcBase[u8PGAx];
    u8PGAx %= 3U;
    u32PGACRAddr = (uint32_t)&ADCx->PGACR1 + u8PGAx;
    MODIFY_REG8(RW_MEM8(u32PGACRAddr), ADC_PGA_CMD_MSK, au8Cmd[(uint8_t)enNewState]);
}

/**
 * @brief  Configures synchronous mode.
 * @param  [in]  u16SyncUnit            Specify the ADC units which work synchronously.
 *                                      This parameter can be a value of @ref ADC_Synchronous_Unit
 *   @arg  ADC_SYNC_ADC1_ADC2:          ADC1 and ADC2 work synchronously.
 *   @arg  ADC_SYNC_ADC1_ADC2_ADC3:     ADC1, ADC2 and ADC3 work synchronously.
 * @param  [in]  u16SyncMode            Synchronous mode.
 *                                      This parameter can be a value of @ref ADC_Synchronous_Mode
 *   @arg  ADC_SYNC_SSHOT_SEQUENTIAL:   Single shot trigger, sequentially trigger. \
 *                                      When the trigger condition occurs, ADC1 starts before ADC2, \
 *                                      and ADC1 and ADC2 only perform one sample conversion.
 *   @arg  ADC_SYNC_SSHOT_SIMULTANEOUS: Single shot trigger, simultaneously trigger. \
 *                                      When the trigger condition occurs, ADC1 and ADC2 start at the same time, \
 *                                      and ADC1 and ADC2 only perform one sample conversion.
 *   @arg  ADC_SYNC_CONT_SEQUENTIAL:    Continuously trigger, sequentially trigger. \
 *                                      When the trigger condition occurs, ADC1 starts before ADC2, \
 *                                      and ADC1 and ADC2 will continue to sample conversion until stopped by software.
 *   @arg  ADC_SYNC_CONT_SIMULTANEOUS:  Continuously trigger, simultaneously trigger. \
 *                                      When the trigger condition occurs, ADC1 and ADC2 start at the same time, \
 *                                      and ADC1 and ADC2 will continue to sample conversion until stopped by software.
 * @param  [in]  u8TrigDelay            Trigger delay time(PCLK2 cycle), range is [1, 255].
 * @retval None
 */
void ADC_SYNC_Config(uint16_t u16SyncUnit, uint16_t u16SyncMode, uint8_t u8TrigDelay)
{
    DDL_ASSERT(IS_ADC_SYNC_UNIT(u16SyncUnit));
    DDL_ASSERT(IS_ADC_SYNC_MODE(u16SyncMode));
    DDL_ASSERT(IS_ADC_SYNC_TRIG_DLY(u8TrigDelay));

    u16SyncMode |= ((uint16_t)((uint32_t)u8TrigDelay << ADC_SYNCCR_SYNCDLY_POS)) | u16SyncUnit;
    MODIFY_REG16(M4_ADC1->SYNCCR, ADC_SYNC_CFG_MSK, u16SyncMode);
}

/**
 * @brief  Enable or disable synchronous mode.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable synchronous mode.
 *   @arg  Disable:                     Disable synchronous mode.
 * @retval None
 */
void ADC_SYNC_Cmd(en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    WRITE_REG32(bM4_ADC1->SYNCCR_b.SYNCEN, enNewState);
}

/**
 * @brief  Configures sample-hold. Specifies the sample time of sample-hold.
 * @param  [in]  u8SplTime              Sample time(ADCLK cycles) for sample-hold. \
 *                                      It should be more than 0.4 microseconds.
 * @retval None
 */
void ADC_SH_Config(uint8_t u8SplTime)
{
    MODIFY_REG16(M4_ADC1->SHCR, ADC_SH_CFG_MSK, u8SplTime);
}

/**
 * @brief  Enable or disable sample-hold channels.
 * @param  [in]  u32AdcCh               ADC channels.
 *                                      This parameter be values of the following that from @ref ADC_Channel
 *   @arg  ADC_CH0:                     Channel 0 of ADC1.
 *   @arg  ADC_CH1:                     Channel 1 of ADC1.
 *   @arg  ADC_CH2:                     Channel 2 of ADC1.
 * @param  [in]  enNewState:            An en_functional_state_t value.
 *   @arg  Enable:                      Enable the specified sample-hold channels.
 *   @arg  Disable:                     Disable the specified sample-hold channels.
 * @retval None
 */
void ADC_SH_ChannelCmd(uint32_t u32AdcCh, en_functional_state_t enNewState)
{
    DDL_ASSERT(IS_ADC_BIT_MSK(u32AdcCh, ADC_CH0|ADC_CH1|ADC_CH2));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    u32AdcCh <<= ADC_SHCR_SHSEL_POS;
    if (enNewState == Enable)
    {
        SET_REG16_BIT(M4_ADC1->SHCR, u32AdcCh);
    }
    else
    {
        CLEAR_REG16_BIT(M4_ADC1->SHCR, u32AdcCh);
    }
}

/**
 * @brief  Remap the correspondence between ADC channels and analog input pins.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u32AdcCh               This parameter be values of the following that from @ref ADC_Channel
 *   @arg  ADC_CH0 ~ ADC_CH15           For all of ADC units.
 * @param  [in]  u8AdcPinNum            This parameter be a value of @ref ADC_Pin_Number
 *   @arg  ADC123_xxx:                  Pin number belongs to all of ADC units.
 *   @arg  ADC12_xxx:                   Pin number belongs to ADC1 and ADC2.
 *   @arg  ADC3_xxx:                    Pin number belongs to ADC3.
 * @note   The pin number is from 0 to 15 can be remaped.
 * @retval None
 */
void ADC_ChannelRemap(M4_ADC_TypeDef *ADCx, uint32_t u32AdcCh, uint8_t u8AdcPinNum)
{
    uint8_t u8FieldOfs;
    uint32_t u32RegIdx;
    uint32_t u32CHMUXRAddr;
    uint32_t u32ChNum = 0U;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_REMAP_PIN_NUM(u8AdcPinNum));
    DDL_ASSERT(IS_ADC_BIT_MSK(u32AdcCh, ADC_CH_REMAP_ALL));

    u32CHMUXRAddr = (uint32_t)&ADCx->CHMUXR0;
    while (u32AdcCh != 0U)
    {
        if ((u32AdcCh & 0x1UL) != 0U)
        {
            u32RegIdx  = u32ChNum / 4U;
            u8FieldOfs = (uint8_t)((u32ChNum % 4U) << 2U);
            MODIFY_REG16(RW_MEM16(u32CHMUXRAddr + u32RegIdx * 2U), \
                         ((uint32_t)ADC_CH_MAP_PIN_MSK << u8FieldOfs), \
                         ((uint32_t)u8AdcPinNum << u8FieldOfs));
        }

        u32AdcCh >>= 1U;
        u32ChNum++;
    }
}

/**
 * @brief  Get the number of the analog input pin corresponding to the specified ADC unit's channel.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u32AdcCh               ADC channel.
 *                                      This parameter can be one of the following values of @ref ADC_Channel
 *   @arg  ADC_CH0 ~ ADC_CH15
 * @retval An uint8_t type value of ADC pin number that corresponding to the specified channel number.
 *         This parameter can be one of the following values of @ref ADC_Pin_Number
 *   @arg  ADC123_xxx:                  Pin number belongs to all of ADC units.
 *   @arg  ADC12_xxx:                   Pin number belongs to ADC1 and ADC2.
 *   @arg  ADC3_xxx:                    Pin number belongs to ADC3.
 */
uint8_t ADC_GetChannelPinNum(const M4_ADC_TypeDef *ADCx, uint32_t u32AdcCh)
{
    uint32_t u32RegIdx;
    uint32_t u32CHMUXRAddr;
    uint32_t u32ChNum = 0U;
    uint8_t u8RetPinNum;
    uint8_t u8FieldOfs;

    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    DDL_ASSERT(IS_ADC_BIT_MSK(u32AdcCh, ADC_CH_REMAP_ALL));
    DDL_ASSERT(IS_ADC_1_BIT_MSK(u32AdcCh));

    while ((u32AdcCh & (1UL << u32ChNum)) == 0U)
    {
        u32ChNum++;
    }

    u32RegIdx     = u32ChNum / 4U;
    u8FieldOfs    = (uint8_t)((u32ChNum % 4U) << 2U);
    u32CHMUXRAddr = (uint32_t)&ADCx->CHMUXR0 + (u32RegIdx * 2U);
    u8RetPinNum   = (uint8_t)((RW_MEM16(u32CHMUXRAddr) >> u8FieldOfs) & 0xFU);

    return u8RetPinNum;
}

/**
 * @brief  Basic usage of ADC sampling. Get the ADC values of the pins
 *         corresponding to the channels enabled in sequence A.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [out]  pu16AdcVal            Pointer to an uint16_t type memory which the ADC values to be stored.
 *                                      The location of the value store depends on the parameter u8Length.
 *                                      u8Length >= ADCx_CH_COUNT, all of the ADC data registers will be read:
 *                                      pu16AdcVal[0] = value of Channel 0,
 *                                      pu16AdcVal[1] = value of Channel 1,
 *                                      pu16AdcVal[2] = value of Channel 2,
 *                                                  ...
 *                                      u8Length < ADCx_CH_COUNT(ADC1_CH_COUNT or ADC2_CH_COUNT),
 *                                      only the value of the enabled channels will be read:
 *                                      pu16AdcVal[0] = value of the 1st enabled channel,
 *                                      pu16AdcVal[1] = value of the 2nd enabled channel,
 *                                      pu16AdcVal[2] = value of the 3rd enabled channel,
 * @param  [in]  u8Length               The length of the ADC value to be got.
 * @param  [in]  u32Timeout             Timeout value(millisecond).
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:      -pu16AdcVal == NULL.
 *                                     -u8Length == 0.
 *                                     -u32Timeout == 0.
 *                                     -The base address of 'pu16AdcVal' is not 2-byte aligned.
 */
en_result_t ADC_PollingSA(M4_ADC_TypeDef *ADCx, uint16_t pu16AdcVal[], uint8_t u8Length, uint32_t u32Timeout)
{
    uint32_t u32Ch;
    uint32_t u32TimeCnt;
    uint8_t au8DrLen[ADC_UNIT_COUNT] = {ADC1_CH_COUNT, ADC2_CH_COUNT, ADC3_CH_COUNT};
    en_result_t enRet = ErrorInvalidParameter;

