RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
    if ((pu16AdcVal != NULL) && \
        (u8Length != 0U) && (u32Timeout != 0U) && \
        IS_ADDRESS_ALIGN_HALFWORD(&pu16AdcVal[0U]))
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));

        u32TimeCnt = u32Timeout * (HCLK_VALUE / 10U / 1000U);
        enRet = ErrorTimeout;
        /* Start ADC.*/
        WRITE_REG8(ADCx->STR, ADC_STR_STRT);
        while (u32TimeCnt-- != 0U)
        {
            if (READ_REG8_BIT(ADCx->ISR, ADC_SEQ_FLAG_EOCA) != 0U)
            {
                if (u8Length < au8DrLen[ADC_IDX(ADCx)])
                {
                    u32Ch = ADCx->CHSELRA;
                    (void)ADC_GetChannelData(ADCx, u32Ch, pu16AdcVal, u8Length);
                }
                else
                {
                    (void)ADC_GetAllData(ADCx, pu16AdcVal, u8Length);
                }
                /* Clear EOC flag. */
                SET_REG8_BIT(ADCx->ISCLRR, ADC_ISCLRR_CLREOCAF);
                enRet = Ok;
                break;
            }
        }
        if (enRet != Ok)
        {
            /* Stop ADC if timeout. */
            WRITE_REG8(ADCx->STR, 0U);
        }
    }

    return enRet;
}

/**
 * @brief  Start the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @retval None
 */
void ADC_Start(M4_ADC_TypeDef *ADCx)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    WRITE_REG8(ADCx->STR, ADC_STR_STRT);
}

/**
 * @brief  Stop the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @retval None
 */
void ADC_Stop(M4_ADC_TypeDef *ADCx)
{
    DDL_ASSERT(IS_ADC_UNIT(ADCx));
    WRITE_REG8(ADCx->STR, 0U);
}

/**
 * @brief  Get all of the channels' value of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [out]  pu16AdcVal            Pointer to an uint16_t type memory which the ADC values to be stored.
 *                                      pu16AdcVal[0] = value of Channel 0,
 *                                      pu16AdcVal[1] = value of Channel 1,
 *                                      pu16AdcVal[2] = value of Channel 2,
 * @param  [in]  u8Length               The length of the ADC value to be got.
 *                                      It CAN NOT be less than the number of channels of the ADC unit.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:      -pu16AdcVal == NULL.
 *                                     -The base address of 'pu16AdcVal' is not 2-byte aligned.
 */
en_result_t ADC_GetAllData(const M4_ADC_TypeDef *ADCx, uint16_t pu16AdcVal[], uint8_t u8Length)
{
    uint8_t u8AdcIdx;
    uint32_t i;
    uint32_t u32DRAddr;
    uint8_t au8DrLen[ADC_UNIT_COUNT] = {ADC1_CH_COUNT, ADC2_CH_COUNT, ADC3_CH_COUNT};
    en_result_t enRet = ErrorInvalidParameter;

    if ((pu16AdcVal != NULL) && IS_ADDRESS_ALIGN_HALFWORD(&pu16AdcVal[0U]))
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));

        u8AdcIdx = ADC_IDX(ADCx);
        DDL_ASSERT(u8Length >= au8DrLen[u8AdcIdx]);

        if (u8Length > au8DrLen[u8AdcIdx])
        {
            u8Length = au8DrLen[u8AdcIdx];
        }
        u32DRAddr = (uint32_t)&ADCx->DR0;
        for (i=0U; i<u8Length; i++)
        {
            pu16AdcVal[i] = RW_MEM16(u32DRAddr);
            u32DRAddr += 2U;
        }
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get specified channels' value of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in] u32TargetCh             The channels which's ADC values will be read.
 *                                      This parameter can be a value of @ref ADC_Channel
 *   @arg  ADC_CH0 ~ ADC_CH15:          For M4_ADC1 and M4_ADC2.
 *   @arg  ADC_CH0 ~ ADC_CH19:          For M4_ADC3.
 * @param  [out]  pu16AdcVal            Pointer to an uint16_t type memory which the ADC values to be stored.
 *                                      pu16AdcVal[0] = value of the 1st enabled channel,
 *                                      pu16AdcVal[1] = value of the 2nd enabled channel,
 *                                      pu16AdcVal[2] = value of the 3rd enabled channel,
 * @param  [in]  u8Length               The length of the ADC value to be got.
 * @retval An en_result_t enumeration value.
 *   @arg  Ok:                          No errors occurred.
 *   @arg  ErrorInvalidParameter:      -u32TargetCh = 0.
 *                                     -pu16AdcVal == NULL.
 *                                     -u8Length == 0.
 *                                     -The base address of 'pu16AdcVal' is not 2-byte aligned.
 */
en_result_t ADC_GetChannelData(const M4_ADC_TypeDef *ADCx, uint32_t u32TargetCh, \
                               uint16_t pu16AdcVal[], uint8_t u8Length)
{
    uint8_t  j = 0U;
    uint32_t i = 0U;
    uint32_t u32DRAddr;
    uint32_t au32ChAllMsk[] = {ADC1_CH_ALL, ADC2_CH_ALL, ADC3_CH_ALL};
    en_result_t enRet = ErrorInvalidParameter;

    if ((u32TargetCh != 0U) && (pu16AdcVal != NULL) &&
        IS_ADDRESS_ALIGN_HALFWORD(&pu16AdcVal[0U]) && (u8Length != 0U))
    {
        DDL_ASSERT(IS_ADC_UNIT(ADCx));
        u32TargetCh &= au32ChAllMsk[ADC_IDX(ADCx)];
        u32DRAddr    = (uint32_t)&ADCx->DR0;
        while ((u32TargetCh != 0U) && (u8Length != 0U))
        {
            if ((u32TargetCh & 0x1UL) != 0U)
            {
                pu16AdcVal[j++] = RW_MEM16(u32DRAddr + i * 2U);
                u8Length--;
            }
            u32TargetCh >>= 1U;
            i++;
        }

