RT-Thread/rt-thread/bsp/hc32f4a0/Libraries/HC32F4A0_StdPeriph_Driver/src/hc32f4a0_adc.c
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Get a specified channel's value of the specified ADC unit.
 * @param  [in]  ADCx                   Pointer to ADC instance register base.
 *                                      This parameter can be a value of the following:
 *   @arg  M4_ADC1:                     ADC unit 1 instance register base.
 *   @arg  M4_ADC2:                     ADC unit 2 instance register base.
 *   @arg  M4_ADC3:                     ADC unit 3 instance register base.
 * @param  [in]  u8ChNum                The index number of ADC channel.
 *                                      The following parameters that from @ref ADC_Channel_Number can be used:
 *   @arg  ADC_CH_NUM_0 ~ ADC_CH_NUM_15: For ADC1 and ADC2.
 *   @arg  ADC_CH_NUM_0 ~ ADC_CH_NUM_19: For ADC3.
 * @retval An uint16_t type value between 0 ~ 4095.
 */
uint16_t ADC_GetValue(const M4_ADC_TypeDef *ADCx, uint8_t u8ChNum)
{
    uint32_t u32DRAddr;
#ifdef __DEBUG
    uint8_t au8DrLen[ADC_UNIT_COUNT] = {ADC1_CH_COUNT, ADC2_CH_COUNT, ADC3_CH_COUNT};
    DDL_ASSERT(u8ChNum < au8DrLen[ADC_IDX(ADCx)]);
#endif
    DDL_ASSERT(IS_ADC_UNIT(ADCx));

    u32DRAddr = (uint32_t)&ADCx->DR0 + ((uint32_t)u8ChNum * 2U);
    return RW_MEM16(u32DRAddr);
}

/**
 * @}
 */

#endif /* DDL_ADC_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
